jmeter.log
2025-12-14 13:40:21,739 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-12-14 13:40:21,762 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.5/bin/user.properties
2025-12-14 13:40:21,762 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.5/bin/system.properties
2025-12-14 13:40:21,763 INFO o.a.j.JMeter: Setting System property: log4j2.formatMsgNoLookups=true
2025-12-14 13:40:21,763 INFO o.a.j.JMeter: Setting JMeter property: host=localhost
2025-12-14 13:40:21,763 INFO o.a.j.JMeter: Setting JMeter property: port=8080
2025-12-14 13:40:21,763 INFO o.a.j.JMeter: Setting JMeter property: protocol=http
2025-12-14 13:40:21,776 INFO o.a.j.JMeter: Copyright (c) 1998-2022 The Apache Software Foundation
2025-12-14 13:40:21,776 INFO o.a.j.JMeter: Version 5.5
2025-12-14 13:40:21,777 INFO o.a.j.JMeter: java.version=1.8.0_275
2025-12-14 13:40:21,777 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-12-14 13:40:21,777 INFO o.a.j.JMeter: os.name=Linux
2025-12-14 13:40:21,778 INFO o.a.j.JMeter: os.arch=amd64
2025-12-14 13:40:21,778 INFO o.a.j.JMeter: os.version=6.8.0-1030-azure
2025-12-14 13:40:21,778 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-12-14 13:40:21,778 INFO o.a.j.JMeter: java.awt.headless=true
2025-12-14 13:40:21,778 INFO o.a.j.JMeter: Max memory     =3649044480
2025-12-14 13:40:21,778 INFO o.a.j.JMeter: Available Processors =2
2025-12-14 13:40:21,786 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-12-14 13:40:21,787 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-12-14 13:40:21,787 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.5
2025-12-14 13:40:21,787 INFO o.a.j.JMeter: user.dir  =/test
2025-12-14 13:40:21,788 INFO o.a.j.JMeter: PWD       =/test
2025-12-14 13:40:21,788 INFO o.a.j.JMeter: IP: 127.0.0.1 Name: codespaces-252898 FullName: localhost
2025-12-14 13:40:21,817 INFO o.a.j.s.FileServer: Default base='/test'
2025-12-14 13:40:21,818 INFO o.a.j.s.FileServer: Set new base='/test/src/performanceTest'
2025-12-14 13:40:21,997 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-12-14 13:40:22,028 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-12-14 13:40:22,034 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-12-14 13:40:22,043 INFO o.a.j.s.SaveService: Loading file: src/performanceTest/perf-getAllComponentLists.jmx
2025-12-14 13:40:22,103 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-14 13:40:22,103 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-14 13:40:22,103 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-14 13:40:22,103 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-14 13:40:22,103 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-12-14 13:40:22,103 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-12-14 13:40:22,538 INFO o.a.j.JMeter: Creating summariser <summary>
2025-12-14 13:40:22,570 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-12-14 13:40:22,571 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-14 13:40:22,571 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-14 13:40:22,586 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-12-14 13:40:22,587 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-12-14 13:40:22,989 INFO o.a.j.JMeter: Running test (1765716022989)
2025-12-14 13:40:23,044 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2025-12-14 13:40:23,044 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group Thread Group.
2025-12-14 13:40:23,044 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-12-14 13:40:23,045 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=1 delayedStart=false
2025-12-14 13:40:23,055 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2025-12-14 13:40:23,073 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-12-14 13:40:23,074 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-12-14 13:40:23,094 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = codespaces-252898
2025-12-14 13:40:23,101 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-12-14 13:40:23,104 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-12-14 13:40:23,104 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2025-12-14 13:40:23,104 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-12-14 13:40:23,104 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-12-14 13:40:23,148 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-2
2025-12-14 13:40:23,246 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-3
2025-12-14 13:40:23,347 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-4
2025-12-14 13:40:23,450 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-5
2025-12-14 13:40:23,476 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-2
2025-12-14 13:40:23,478 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-2
2025-12-14 13:40:23,478 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-4
2025-12-14 13:40:23,483 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-4
2025-12-14 13:40:23,476 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2025-12-14 13:40:23,483 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-5
2025-12-14 13:40:23,484 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-5
2025-12-14 13:40:23,486 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2025-12-14 13:40:23,483 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-3
2025-12-14 13:40:23,489 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-3
2025-12-14 13:40:23,548 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-6
2025-12-14 13:40:23,555 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-6
2025-12-14 13:40:23,555 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-6
2025-12-14 13:40:23,647 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-7
2025-12-14 13:40:23,654 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-7
2025-12-14 13:40:23,655 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-7
2025-12-14 13:40:23,748 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-8
2025-12-14 13:40:23,756 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-8
2025-12-14 13:40:23,756 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-8
2025-12-14 13:40:23,847 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-9
2025-12-14 13:40:23,855 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-9
2025-12-14 13:40:23,855 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-9
2025-12-14 13:40:23,950 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-10
2025-12-14 13:40:23,958 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-10
2025-12-14 13:40:23,958 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-10
2025-12-14 13:40:23,959 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-12-14 13:40:23,961 INFO o.a.j.r.Summariser: summary =     10 in 00:00:01 =   10.3/s Avg:    91 Min:     5 Max:   272 Err:     0 (0.00%)